-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ellessenne/Documents/swjm/01-example-swjm/01b-data-analysis
> -log.txt
  log type:  text
 opened on:   2 Oct 2024, 10:12:07

. 
. // Constant intervention model
. 
. use "01-dt-ci.dta", clear

. compress
  variable i was long now byte
  variable id was long now int
  variable j was long now byte
  variable jid was long now int
  variable repn was double now byte
  variable x was double now byte
  variable cumx was double now byte
  variable t0 was double now byte
  variable d was double now byte
  (720,000 bytes saved)

. save, replace
file 01-dt-ci.dta saved

. 
. // Linear mixed-effects model
. gsem (yobs <- ibn.j i.x M1[i]@1 M2[i>id]@1, noconstant family(gaussian))

Fitting fixed-effects model:

Iteration 0:  Log likelihood = -28813.635  
Iteration 1:  Log likelihood = -28813.635  

Refining starting values:

Grid node 0:  Log likelihood = -28381.864

Fitting full model:

Iteration 0:  Log likelihood = -28381.864  
Iteration 1:  Log likelihood = -28274.637  
Iteration 2:  Log likelihood = -27899.486  
Iteration 3:  Log likelihood = -27893.009  
Iteration 4:  Log likelihood = -27892.795  
Iteration 5:  Log likelihood = -27892.793  

Generalized structural equation model                    Number of obs = 8,145
Response: yobs    
Family:   Gaussian
Link:     Identity
Log likelihood = -27892.793

 ( 1)  [yobs]_cons = 0
 ( 2)  [yobs]M1[i] = 1
 ( 3)  [yobs]M2[i>id] = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
yobs         |
           j |
          1  |   25.36638   .3470937    73.08   0.000     24.68609    26.04667
          2  |   24.43274    .358728    68.11   0.000     23.72964    25.13583
          3  |   24.63693   .3802935    64.78   0.000     23.89157    25.38229
          4  |   24.37088   .4082865    59.69   0.000     23.57065     25.1711
          5  |   24.08886   .4439499    54.26   0.000     23.21873    24.95898
             |
         1.x |    20.2868   .2567767    79.01   0.000     19.78353    20.79007
             |
       M1[i] |          1  (constrained)
    M2[i>id] |          1  (constrained)
             |
       _cons |          0  (omitted)
-------------+----------------------------------------------------------------
   var(M1[i])|    2.75273   .8425952                       1.51083     5.01547
var(M2[i>id])|   26.88594   1.252997                      24.53893    29.45742
-------------+----------------------------------------------------------------
  var(e.yobs)|   40.30883   .7253204                        38.912    41.75579
------------------------------------------------------------------------------

. estimates store mod_ci_lmm

. 
. // The equivalent model with -mixed- is:
. mixed yobs ibn.j i.x, noconstant || i: || id:

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -27892.793  
Iteration 1:  Log likelihood = -27892.793  

Computing standard errors ...

Mixed-effects ML regression                           Number of obs =    8,145

        Grouping information
        -------------------------------------------------------------
                        |     No. of       Observations per group
         Group variable |     groups    Minimum    Average    Maximum
        ----------------+--------------------------------------------
                      i |         32        205      254.5        300
                     id |      1,956          1        4.2          5
        -------------------------------------------------------------

                                                      Wald chi2(6)  = 25569.47
Log likelihood = -27892.793                           Prob > chi2   =   0.0000

------------------------------------------------------------------------------
        yobs | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
           j |
          1  |   25.36638    .347168    73.07   0.000     24.68594    26.04682
          2  |   24.43274   .3586293    68.13   0.000     23.72984    25.13564
          3  |   24.63693   .3799635    64.84   0.000     23.89222    25.38165
          4  |   24.37088   .4076872    59.78   0.000     23.57183    25.16993
          5  |   24.08886   .4432243    54.35   0.000     23.22016    24.95757
             |
         1.x |   20.28679   .2567428    79.02   0.000     19.78359       20.79
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
i: Identity                  |
                  var(_cons) |   2.754548   .8434546      1.511502    5.019864
-----------------------------+------------------------------------------------
id: Identity                 |
                  var(_cons) |   26.88605   1.253004      24.53903    29.45755
-----------------------------+------------------------------------------------
               var(Residual) |    40.3088   .7253198      38.91198    41.75577
------------------------------------------------------------------------------
LR test vs. linear model: chi2(2) = 1841.69               Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. 
. // Joint model
. gsem ///
>         (yobs <- ibn.j i.x M1[i]@1 M2[i>id]@1, noconstant family(gaussian)) /
> //
>         (t <- i.x M1[i] M2[i>id], family(weibull, failure(d) lt(t0)))

Fitting fixed-effects model:

Iteration 0:  Log likelihood = -37126.744  
Iteration 1:  Log likelihood = -32543.894  
Iteration 2:  Log likelihood = -32275.472  
Iteration 3:  Log likelihood = -32200.348  
Iteration 4:  Log likelihood = -32200.298  
Iteration 5:  Log likelihood = -32200.298  

Refining starting values:

Grid node 0:  Log likelihood = -32014.153

Fitting full model:

Iteration 0:  Log likelihood = -32014.153  (not concave)
Iteration 1:  Log likelihood = -31937.249  (not concave)
Iteration 2:  Log likelihood = -31641.998  
Iteration 3:  Log likelihood = -31323.784  
Iteration 4:  Log likelihood =  -31079.32  
Iteration 5:  Log likelihood = -31018.134  
Iteration 6:  Log likelihood = -30980.508  
Iteration 7:  Log likelihood = -30974.163  
Iteration 8:  Log likelihood = -30974.229  
Iteration 9:  Log likelihood =  -30973.92  
Iteration 10: Log likelihood = -30974.115  
Iteration 11: Log likelihood = -30973.965  
Iteration 12: Log likelihood = -30974.082  
Iteration 13: Log likelihood = -30973.994  
Iteration 14: Log likelihood = -30974.068  
Iteration 15: Log likelihood = -30974.012  
Iteration 16: Log likelihood =  -30974.06  
Iteration 17: Log likelihood = -30974.023  
Iteration 18: Log likelihood = -30974.055  
Iteration 19: Log likelihood =  -30974.03  
Iteration 20: Log likelihood = -30974.052  
Iteration 21: Log likelihood = -30974.034  
Iteration 22: Log likelihood = -30974.049  
Iteration 23: Log likelihood = -30974.037  
Iteration 24: Log likelihood = -30974.048  
Iteration 25: Log likelihood = -30974.039  
Iteration 26: Log likelihood = -30974.046  
Iteration 27: Log likelihood = -30974.041  
Iteration 28: Log likelihood = -30974.046  
Iteration 29: Log likelihood = -30974.042  
Iteration 30: Log likelihood = -30974.045  
Iteration 31: Log likelihood = -30974.042  

Generalized structural equation model               Number of obs   =    9,933

Response: yobs                                      Number of obs   =    8,145
Family:   Gaussian            
Link:     Identity            

Response: t                                         Number of obs   =    9,933
Family:   Weibull                                   No. of failures =    1,788
Form:     Proportional hazards                      Time at risk    = 8,705.02
Link:     Log                 

Log likelihood = -30974.042

 ( 1)  [yobs]_cons = 0
 ( 2)  [yobs]M1[i] = 1
 ( 3)  [yobs]M2[i>id] = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
yobs         |
           j |
          1  |    29.9577   .3481775    86.04   0.000     29.27529    30.64012
          2  |   29.50618   .3643372    80.99   0.000     28.79209    30.22026
          3  |   29.97324    .387923    77.27   0.000     29.21292    30.73355
          4  |   29.82219   .4163634    71.63   0.000     29.00613    30.63825
          5  |    29.6149   .4515221    65.59   0.000     28.72994    30.49987
             |
         1.x |   20.25012   .2540104    79.72   0.000     19.75227    20.74797
             |
       M1[i] |          1  (constrained)
    M2[i>id] |          1  (constrained)
             |
       _cons |          0  (omitted)
-------------+----------------------------------------------------------------
t            |
         1.x |   -.400578   .0929956    -4.31   0.000    -.5828459     -.21831
             |
       M1[i] |  -.1319004   .0451246    -2.92   0.003    -.2203429   -.0434579
    M2[i>id] |   .4166568   .0237881    17.52   0.000     .3700329    .4632806
             |
       _cons |  -1.719202   .1493741   -11.51   0.000    -2.011969   -1.426434
-------------+----------------------------------------------------------------
/t           |
        ln_p |    .083451   .0557677                     -.0258516    .1927536
-------------+----------------------------------------------------------------
   var(M1[i])|   2.113537    .706759                      1.097416    4.070507
var(M2[i>id])|   58.53769   2.807157                      53.28641    64.30647
-------------+----------------------------------------------------------------
  var(e.yobs)|   39.95259   .7041711                        38.596    41.35685
------------------------------------------------------------------------------

. estimates store mod_ci_jm

. 
. // Compare the estimates
. estimates table mod_ci_lmm mod_ci_jm

----------------------------------------
    Variable | mod_ci_lmm   mod_ci_jm   
-------------+--------------------------
yobs         |
           j |
          1  |  25.366378    29.957704  
          2  |  24.432739    29.506175  
          3  |  24.636927    29.973235  
          4  |  24.370878    29.822191  
          5  |  24.088858    29.614903  
             |
           x |
          1  |    20.2868     20.25012  
             |
       M1[i] |          1            1  
    M2[i>id] |          1            1  
             |
       _cons |          0            0  
-------------+--------------------------
   var(M1[i])|    2.75273    2.1135374  
var(M2[i>id])|  26.885937    58.537693  
  var(e.yobs)|  40.308827    39.952587  
-------------+--------------------------
t            |
             |
           x |
          1  |              -.40057799  
             |
       M1[i] |              -.13190041  
    M2[i>id] |               .41665676  
             |
       _cons |              -1.7192015  
             |
           x |
          1  |              -.40057799  
             |
       M1[i] |              -.13190041  
    M2[i>id] |               .41665676  
             |
       _cons |              -1.7192015  
----------------------------------------

. 
. // General time on treatment model
. 
. use "01-dt-gi.dta", clear

. compress
  variable i was long now byte
  variable id was long now int
  variable j was long now byte
  variable jid was long now int
  variable repn was double now byte
  variable x was double now byte
  variable cumx was double now byte
  variable t0 was double now byte
  variable d was double now byte
  (720,000 bytes saved)

. save, replace
file 01-dt-gi.dta saved

. 
. // Linear mixed-effects model
. gsem (yobs <- ibn.j i.cumx M1[i]@1 M2[i>id]@1, noconstant family(gaussian))

Fitting fixed-effects model:

Iteration 0:  Log likelihood = -28852.977  
Iteration 1:  Log likelihood = -28852.977  

Refining starting values:

Grid node 0:  Log likelihood = -28514.686

Fitting full model:

Iteration 0:  Log likelihood = -28514.686  
Iteration 1:  Log likelihood =  -28135.36  
Iteration 2:  Log likelihood = -28093.921  
Iteration 3:  Log likelihood = -28092.453  
Iteration 4:  Log likelihood = -28092.444  
Iteration 5:  Log likelihood = -28092.444  

Generalized structural equation model                    Number of obs = 8,198
Response: yobs    
Family:   Gaussian
Link:     Identity
Log likelihood = -28092.444

 ( 1)  [yobs]_cons = 0
 ( 2)  [yobs]M1[i] = 1
 ( 3)  [yobs]M2[i>id] = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
yobs         |
           j |
          1  |    25.7234   .3112324    82.65   0.000     25.11339     26.3334
          2  |   24.90799   .3274861    76.06   0.000     24.26613    25.54985
          3  |   24.88938   .3587506    69.38   0.000     24.18624    25.59252
          4  |   24.54843   .4174466    58.81   0.000     23.73025    25.36661
          5  |   24.23775   .5195956    46.65   0.000     23.21936    25.25614
             |
        cumx |
          1  |    .396264   .2779114     1.43   0.154    -.1484323    .9409603
          2  |   10.41726   .3688381    28.24   0.000     9.694347    11.14017
          3  |   20.51464   .4871761    42.11   0.000     19.55979    21.46948
          4  |   31.34752   .6607044    47.45   0.000     30.05256    32.64248
             |
       M1[i] |          1  (constrained)
    M2[i>id] |          1  (constrained)
             |
       _cons |          0  (omitted)
-------------+----------------------------------------------------------------
   var(M1[i])|   2.046659    .660102                      1.087703    3.851063
var(M2[i>id])|   24.12357   1.167287                      21.94087    26.52341
-------------+----------------------------------------------------------------
  var(e.yobs)|   41.40815   .7438908                      39.97552    42.89212
------------------------------------------------------------------------------

. estimates store mod_gi_lmm

. 
. // The equivalent model with -mixed- is:
. mixed yobs ibn.j i.cumx, noconstant || i: || id:

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -28092.444  
Iteration 1:  Log likelihood = -28092.444  

Computing standard errors ...

Mixed-effects ML regression                           Number of obs =    8,198

        Grouping information
        -------------------------------------------------------------
                        |     No. of       Observations per group
         Group variable |     groups    Minimum    Average    Maximum
        ----------------+--------------------------------------------
                      i |         32        199      256.2        336
                     id |      1,997          1        4.1          5
        -------------------------------------------------------------

                                                      Wald chi2(9)  = 20911.57
Log likelihood = -28092.444                           Prob > chi2   =   0.0000

------------------------------------------------------------------------------
        yobs | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
           j |
          1  |    25.7234   .3112385    82.65   0.000     25.11338    26.33341
          2  |   24.90799   .3272545    76.11   0.000     24.26658     25.5494
          3  |   24.88938   .3580435    69.51   0.000     24.18763    25.59114
          4  |   24.54843   .4161454    58.99   0.000      23.7328    25.36406
          5  |   24.23776   .5177476    46.81   0.000     23.22299    25.25252
             |
        cumx |
          1  |   .3962598   .2773453     1.43   0.153    -.1473269    .9398465
          2  |   10.41725   .3677636    28.33   0.000     9.696447    11.13805
          3  |   20.51463   .4854078    42.26   0.000     19.56324    21.46601
          4  |   31.34751    .659081    47.56   0.000     30.05573    32.63928
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
i: Identity                  |
                  var(_cons) |   2.046817   .6601584      1.087781    3.851381
-----------------------------+------------------------------------------------
id: Identity                 |
                  var(_cons) |   24.12358   1.167288      21.94088    26.52342
-----------------------------+------------------------------------------------
               var(Residual) |   41.40813   .7438904       39.9755     42.8921
------------------------------------------------------------------------------
LR test vs. linear model: chi2(2) = 1521.07               Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. 
. // Joint model
. gsem ///
>         (yobs <- ibn.j i.cumx M1[i]@1 M2[i>id]@1, noconstant family(gaussian)
> ) ///
>         (t <- i.x M1[i] M2[i>id], family(weibull, failure(d) lt(t0)))

Fitting fixed-effects model:

Iteration 0:  Log likelihood = -37233.532  
Iteration 1:  Log likelihood = -32594.876  
Iteration 2:  Log likelihood = -32320.665  
Iteration 3:  Log likelihood = -32241.122  
Iteration 4:  Log likelihood = -32241.056  
Iteration 5:  Log likelihood = -32241.056  

Refining starting values:

Grid node 0:  Log likelihood = -32093.827

Fitting full model:

Iteration 0:  Log likelihood = -32093.827  (not concave)
Iteration 1:  Log likelihood =  -31997.22  (not concave)
Iteration 2:  Log likelihood = -31733.823  
Iteration 3:  Log likelihood = -31485.162  
Iteration 4:  Log likelihood = -31344.376  
Iteration 5:  Log likelihood = -31267.101  
Iteration 6:  Log likelihood = -31241.678  
Iteration 7:  Log likelihood = -31214.818  
Iteration 8:  Log likelihood = -31207.156  
Iteration 9:  Log likelihood = -31211.582  
Iteration 10: Log likelihood = -31207.225  
Iteration 11: Log likelihood = -31211.116  
Iteration 12: Log likelihood = -31207.479  
Iteration 13: Log likelihood = -31209.951  
Iteration 14: Log likelihood = -31208.141  
Iteration 15: Log likelihood = -31209.393  
Iteration 16: Log likelihood = -31208.474  
Iteration 17: Log likelihood = -31209.036  
Iteration 18: Log likelihood = -31208.692  
Iteration 19: Log likelihood = -31208.902  
Iteration 20: Log likelihood = -31208.773  
Iteration 21: Log likelihood = -31208.852  
Iteration 22: Log likelihood = -31208.803  
Iteration 23: Log likelihood = -31208.833  
Iteration 24: Log likelihood = -31208.815  
Iteration 25: Log likelihood = -31208.826  
Iteration 26: Log likelihood = -31208.819  
Iteration 27: Log likelihood = -31208.823  
Iteration 28: Log likelihood =  -31208.82  

Generalized structural equation model               Number of obs   =    9,984

Response: yobs                                      Number of obs   =    8,198
Family:   Gaussian            
Link:     Identity            

Response: t                                         Number of obs   =    9,984
Family:   Weibull                                   No. of failures =    1,786
Form:     Proportional hazards                      Time at risk    = 8,764.68
Link:     Log                 

Log likelihood = -31208.82

 ( 1)  [yobs]_cons = 0
 ( 2)  [yobs]M1[i] = 1
 ( 3)  [yobs]M2[i>id] = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
yobs         |
           j |
          1  |   29.75072   .3250103    91.54   0.000     29.11371    30.38773
          2  |   29.53576   .3440455    85.85   0.000     28.86144    30.21008
          3  |    29.8328   .3756594    79.41   0.000     29.09652    30.56908
          4  |   29.71095   .4324645    68.70   0.000     28.86334    30.55857
          5  |    29.6447   .5310901    55.82   0.000     28.60378    30.68562
             |
        cumx |
          1  |   .1929464   .2760282     0.70   0.485    -.3480588    .7339517
          2  |   10.09853   .3656931    27.61   0.000     9.381788    10.81528
          3  |   20.07023   .4828016    41.57   0.000     19.12396     21.0165
          4  |   30.74097   .6552711    46.91   0.000     29.45667    32.02528
             |
       M1[i] |          1  (constrained)
    M2[i>id] |          1  (constrained)
             |
       _cons |          0  (omitted)
-------------+----------------------------------------------------------------
t            |
         1.x |  -.5396543   .0942133    -5.73   0.000    -.7243089   -.3549996
             |
       M1[i] |  -.0557346   .0406569    -1.37   0.170    -.1354205    .0239514
    M2[i>id] |   .4376595   .0237903    18.40   0.000     .3910313    .4842877
             |
       _cons |  -1.641972   .1258964   -13.04   0.000    -1.888724    -1.39522
-------------+----------------------------------------------------------------
/t           |
        ln_p |   .0796326   .0521455                     -.0225707    .1818359
-------------+----------------------------------------------------------------
   var(M1[i])|   2.003844   .6624552                      1.048246     3.83058
var(M2[i>id])|   52.21325   2.574714                      47.40309     57.5115
-------------+----------------------------------------------------------------
  var(e.yobs)|   41.01044   .7196215                      39.62399    42.44541
------------------------------------------------------------------------------

. estimates store mod_gi_jm

. 
. // Compare the estimates
. estimates table mod_gi_lmm mod_gi_jm

----------------------------------------
    Variable | mod_gi_lmm   mod_gi_jm   
-------------+--------------------------
yobs         |
           j |
          1  |  25.723395    29.750722  
          2  |   24.90799    29.535759  
          3  |   24.88938      29.8328  
          4  |  24.548429    29.710951  
          5  |  24.237749    29.644701  
             |
        cumx |
          1  |  .39626403    .19294641  
          2  |  10.417257    10.098533  
          3  |  20.514635     20.07023  
          4  |   31.34752    30.740974  
             |
       M1[i] |          1            1  
    M2[i>id] |          1            1  
             |
       _cons |          0            0  
-------------+--------------------------
   var(M1[i])|  2.0466588     2.003844  
var(M2[i>id])|   24.12357    52.213247  
  var(e.yobs)|  41.408148    41.010441  
-------------+--------------------------
t            |
             |
           x |
          1  |              -.53965426  
             |
       M1[i] |              -.05573455  
    M2[i>id] |               .43765948  
             |
       _cons |               -1.641972  
             |
           x |
          1  |              -.53965426  
             |
       M1[i] |              -.05573455  
    M2[i>id] |               .43765948  
             |
       _cons |               -1.641972  
----------------------------------------

. 
. // Close log
. log close
      name:  <unnamed>
       log:  /Users/ellessenne/Documents/swjm/01-example-swjm/01b-data-analysis
> -log.txt
  log type:  text
 closed on:   2 Oct 2024, 10:12:41
-------------------------------------------------------------------------------
