-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ellessenne/Documents/swjm/02-example-swjm-individual/02b-da
> ta-analysis-log.txt
  log type:  text
 opened on:   2 Oct 2024, 10:12:50

. 
. // Constant intervention model
. 
. use "02-dt-ci.dta", clear

. compress
  variable i was long now byte
  variable id was long now int
  variable j was long now byte
  variable jid was long now int
  variable repn was double now byte
  variable x was double now byte
  variable cumx was double now byte
  variable t0 was double now byte
  variable d was double now byte
  (720,000 bytes saved)

. save, replace
file 02-dt-ci.dta saved

. 
. // Linear mixed-effects model
. gsem (yobs <- ibn.j i.x M1[id]@1, noconstant family(gaussian))

Fitting fixed-effects model:

Iteration 0:  Log likelihood = -28901.613  
Iteration 1:  Log likelihood = -28901.613  

Refining starting values:

Grid node 0:  Log likelihood = -28567.986

Fitting full model:

Iteration 0:  Log likelihood = -28567.986  
Iteration 1:  Log likelihood = -28181.679  
Iteration 2:  Log likelihood = -28178.871  
Iteration 3:  Log likelihood = -28178.865  
Iteration 4:  Log likelihood = -28178.865  

Generalized structural equation model                    Number of obs = 8,264
Response: yobs    
Family:   Gaussian
Link:     Identity
Log likelihood = -28178.865

 ( 1)  [yobs]_cons = 0
 ( 2)  [yobs]M1[id] = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
yobs         |
           j |
          1  |   25.62105   .1822053   140.62   0.000     25.26394    25.97817
          2  |    25.0775   .2025916   123.78   0.000     24.68043    25.47457
          3  |    25.1812    .235136   107.09   0.000     24.72034    25.64206
          4  |   24.87247   .2736207    90.90   0.000     24.33619    25.40876
          5  |   24.67969   .3156921    78.18   0.000     24.06094    25.29844
             |
         1.x |   20.07496   .2404924    83.47   0.000      19.6036    20.54631
             |
      M1[id] |          1  (constrained)
             |
       _cons |          0  (omitted)
-------------+----------------------------------------------------------------
  var(M1[id])|    24.5011   1.155849                      22.33725    26.87456
-------------+----------------------------------------------------------------
  var(e.yobs)|   40.07049   .7133496                      38.69646    41.49331
------------------------------------------------------------------------------

. estimates store mod_ci_lmm

. 
. // The equivalent model with -mixed- is:
. mixed yobs ibn.j i.x, noconstant || id:

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -28178.865  
Iteration 1:  Log likelihood = -28178.865  

Computing standard errors ...

Mixed-effects ML regression                        Number of obs    =    8,264
Group variable: id                                 Number of groups =    1,945
                                                   Obs per group:
                                                                min =        1
                                                                avg =      4.2
                                                                max =        5
                                                   Wald chi2(6)     = 80069.28
Log likelihood = -28178.865                        Prob > chi2      =   0.0000

------------------------------------------------------------------------------
        yobs | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
           j |
          1  |   25.62105   .1822053   140.62   0.000     25.26394    25.97817
          2  |    25.0775    .202255   123.99   0.000     24.68109    25.47391
          3  |    25.1812   .2343789   107.44   0.000     24.72183    25.64058
          4  |   24.87248   .2725793    91.25   0.000     24.33823    25.40672
          5  |   24.67969   .3144783    78.48   0.000     24.06332    25.29606
             |
         1.x |   20.07496   .2403311    83.53   0.000     19.60392      20.546
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                  var(_cons) |   24.50111    1.15585      22.33727    26.87457
-----------------------------+------------------------------------------------
               var(Residual) |   40.07049   .7133495      38.69646     41.4933
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1445.50       Prob >= chibar2 = 0.0000

. 
. // Joint model
. gsem ///
>         (yobs <- ibn.j i.x M1[id]@1, noconstant family(gaussian)) ///
>         (t <- i.x M1[id], family(weibull, failure(d) lt(t0)))

Fitting fixed-effects model:

Iteration 0:  Log likelihood = -37340.459  
Iteration 1:  Log likelihood = -32351.023  
Iteration 2:  Log likelihood =  -32029.33  
Iteration 3:  Log likelihood = -31947.817  
Iteration 4:  Log likelihood = -31947.768  
Iteration 5:  Log likelihood = -31947.768  

Refining starting values:

Grid node 0:  Log likelihood =  -31876.54

Fitting full model:

Iteration 0:  Log likelihood =  -31876.54  (not concave)
Iteration 1:  Log likelihood = -31758.077  (not concave)
Iteration 2:  Log likelihood = -31548.799  (not concave)
Iteration 3:  Log likelihood = -31310.926  
Iteration 4:  Log likelihood = -31143.962  
Iteration 5:  Log likelihood = -31054.456  
Iteration 6:  Log likelihood = -31030.609  
Iteration 7:  Log likelihood = -31013.805  
Iteration 8:  Log likelihood = -31001.505  
Iteration 9:  Log likelihood = -30998.899  
Iteration 10: Log likelihood = -30999.533  
Iteration 11: Log likelihood = -30999.315  
Iteration 12: Log likelihood =  -30999.44  
Iteration 13: Log likelihood = -30999.415  
Iteration 14: Log likelihood = -30999.448  
Iteration 15: Log likelihood =  -30999.45  
Iteration 16: Log likelihood = -30999.462  
Iteration 17: Log likelihood = -30999.466  
Iteration 18: Log likelihood = -30999.471  
Iteration 19: Log likelihood = -30999.474  
Iteration 20: Log likelihood = -30999.477  
Iteration 21: Log likelihood = -30999.478  
Iteration 22: Log likelihood =  -30999.48  
Iteration 23: Log likelihood = -30999.481  

Generalized structural equation model               Number of obs   =    9,973

Response: yobs                                      Number of obs   =    8,264
Family:   Gaussian            
Link:     Identity            

Response: t                                         Number of obs   =    9,973
Family:   Weibull                                   No. of failures =    1,709
Form:     Proportional hazards                      Time at risk    = 8,796.52
Link:     Log                 

Log likelihood = -30999.481

 ( 1)  [yobs]_cons = 0
 ( 2)  [yobs]M1[id] = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
yobs         |
           j |
          1  |   29.67113   .2129415   139.34   0.000     29.25377    30.08848
          2  |    29.6666   .2341692   126.69   0.000     29.20763    30.12556
          3  |   29.99079   .2639832   113.61   0.000      29.4734    30.50819
          4  |   29.80659   .2989375    99.71   0.000     29.22069     30.3925
          5  |   29.69191   .3374856    87.98   0.000     29.03045    30.35337
             |
         1.x |   19.87066   .2366138    83.98   0.000     19.40691    20.33442
             |
      M1[id] |          1  (constrained)
             |
       _cons |          0  (omitted)
-------------+----------------------------------------------------------------
t            |
         1.x |  -1.215348   .1079999   -11.25   0.000    -1.427024   -1.003672
             |
      M1[id] |   .4190502   .0217486    19.27   0.000     .3764237    .4616768
             |
       _cons |  -1.526932   .1104629   -13.82   0.000    -1.743435   -1.310428
-------------+----------------------------------------------------------------
/t           |
        ln_p |   .0148239   .0489068                     -.0810316    .1106794
-------------+----------------------------------------------------------------
  var(M1[id])|   52.04023    2.53513                       47.3013    57.25393
-------------+----------------------------------------------------------------
  var(e.yobs)|   39.86028   .6962706                      38.51871    41.24857
------------------------------------------------------------------------------

. estimates store mod_ci_jm

. 
. // Compare the estimates
. estimates table mod_ci_lmm mod_ci_jm

----------------------------------------
    Variable | mod_ci_lmm   mod_ci_jm   
-------------+--------------------------
yobs         |
           j |
          1  |  25.621053    29.671125  
          2  |  25.077498    29.666596  
          3  |  25.181202    29.990793  
          4  |  24.872475    29.806593  
          5  |   24.67969    29.691913  
             |
           x |
          1  |  20.074958    19.870661  
             |
      M1[id] |          1            1  
             |
       _cons |          0            0  
-------------+--------------------------
  var(M1[id])|  24.501098    52.040228  
  var(e.yobs)|  40.070492    39.860277  
-------------+--------------------------
t            |
             |
           x |
          1  |              -1.2153483  
             |
      M1[id] |                .4190502  
             |
       _cons |              -1.5269317  
             |
           x |
          1  |              -1.2153483  
             |
      M1[id] |                .4190502  
             |
       _cons |              -1.5269317  
----------------------------------------

. 
. // General time on treatment model
. 
. use "02-dt-gi.dta", clear

. compress
  variable i was long now byte
  variable id was long now int
  variable j was long now byte
  variable jid was long now int
  variable repn was double now byte
  variable x was double now byte
  variable cumx was double now byte
  variable t0 was double now byte
  variable d was double now byte
  (720,000 bytes saved)

. save, replace
file 02-dt-gi.dta saved

. 
. // Linear mixed-effects model
. gsem (yobs <- ibn.j i.cumx M1[id]@1, noconstant family(gaussian))

Fitting fixed-effects model:

Iteration 0:  Log likelihood = -29319.108  
Iteration 1:  Log likelihood = -29319.108  

Refining starting values:

Grid node 0:  Log likelihood = -28985.644

Fitting full model:

Iteration 0:  Log likelihood = -28985.644  
Iteration 1:  Log likelihood = -28592.855  
Iteration 2:  Log likelihood = -28590.006  
Iteration 3:  Log likelihood = -28590.002  
Iteration 4:  Log likelihood = -28590.002  

Generalized structural equation model                    Number of obs = 8,378
Response: yobs    
Family:   Gaussian
Link:     Identity
Log likelihood = -28590.002

 ( 1)  [yobs]_cons = 0
 ( 2)  [yobs]M1[id] = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
yobs         |
           j |
          1  |   25.77869    .181505   142.03   0.000     25.42295    26.13443
          2  |   25.32782    .202466   125.10   0.000     24.93099    25.72465
          3  |   25.08469   .2392809   104.83   0.000      24.6157    25.55367
          4  |   24.62971   .3021439    81.52   0.000     24.03752     25.2219
          5  |     24.348   .3963056    61.44   0.000     23.57125    25.12474
             |
        cumx |
          1  |   .2402477   .2513938     0.96   0.339    -.2524752    .7329706
          2  |    10.6138   .3247874    32.68   0.000     9.977233    11.25038
          3  |   20.46442   .4215004    48.55   0.000     19.63829    21.29054
          4  |   31.08476   .5730923    54.24   0.000     29.96152      32.208
             |
      M1[id] |          1  (constrained)
             |
       _cons |          0  (omitted)
-------------+----------------------------------------------------------------
  var(M1[id])|   24.61315   1.156918                      22.44695     26.9884
-------------+----------------------------------------------------------------
  var(e.yobs)|   40.28663   .7129477                      38.91324     41.7085
------------------------------------------------------------------------------

. estimates store mod_gi_lmm

. 
. // The equivalent model with -mixed- is:
. mixed yobs ibn.j i.cumx, noconstant || id:

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -28590.002  
Iteration 1:  Log likelihood = -28590.002  

Computing standard errors ...

Mixed-effects ML regression                        Number of obs    =    8,378
Group variable: id                                 Number of groups =    1,970
                                                   Obs per group:
                                                                min =        1
                                                                avg =      4.3
                                                                max =        5
                                                   Wald chi2(9)     = 60432.55
Log likelihood = -28590.002                        Prob > chi2      =   0.0000

------------------------------------------------------------------------------
        yobs | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
           j |
          1  |   25.77869    .181505   142.03   0.000     25.42295    26.13443
          2  |   25.32782   .2021497   125.29   0.000     24.93161    25.72403
          3  |   25.08469   .2384726   105.19   0.000     24.61729    25.55208
          4  |   24.62971   .3009458    81.84   0.000     24.03986    25.21955
          5  |     24.348   .3949052    61.66   0.000       23.574      25.122
             |
        cumx |
          1  |   .2402476   .2513363     0.96   0.339    -.2523624    .7328577
          2  |    10.6138   .3246262    32.70   0.000     9.977549    11.25006
          3  |   20.46442    .421176    48.59   0.000     19.63893    21.28991
          4  |   31.08476   .5727445    54.27   0.000      29.9622    32.20732
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                  var(_cons) |   24.61317   1.156919      22.44696    26.98842
-----------------------------+------------------------------------------------
               var(Residual) |   40.28663   .7129476      38.91323     41.7085
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1458.21       Prob >= chibar2 = 0.0000

. 
. // Joint model
. gsem ///
>         (yobs <- ibn.j i.cumx M1[id]@1, noconstant family(gaussian)) ///
>         (t <- i.x M1[id], family(weibull, failure(d) lt(t0)))

Fitting fixed-effects model:

Iteration 0:  Log likelihood = -37857.709  
Iteration 1:  Log likelihood = -32848.038  
Iteration 2:  Log likelihood = -32532.971  
Iteration 3:  Log likelihood =  -32447.52  
Iteration 4:  Log likelihood = -32447.442  
Iteration 5:  Log likelihood = -32447.442  

Refining starting values:

Grid node 0:  Log likelihood = -32376.721

Fitting full model:

Iteration 0:  Log likelihood = -32376.721  (not concave)
Iteration 1:  Log likelihood = -32263.381  (not concave)
Iteration 2:  Log likelihood = -32047.092  (not concave)
Iteration 3:  Log likelihood = -31804.255  
Iteration 4:  Log likelihood = -31636.048  
Iteration 5:  Log likelihood = -31534.262  
Iteration 6:  Log likelihood = -31500.553  
Iteration 7:  Log likelihood = -31467.316  
Iteration 8:  Log likelihood = -31463.811  
Iteration 9:  Log likelihood = -31463.203  
Iteration 10: Log likelihood = -31463.401  
Iteration 11: Log likelihood = -31463.225  
Iteration 12: Log likelihood = -31463.306  
Iteration 13: Log likelihood = -31463.241  
Iteration 14: Log likelihood = -31463.269  
Iteration 15: Log likelihood = -31463.245  
Iteration 16: Log likelihood = -31463.254  
Iteration 17: Log likelihood = -31463.245  
Iteration 18: Log likelihood = -31463.247  
Iteration 19: Log likelihood = -31463.244  
Iteration 20: Log likelihood = -31463.245  
Iteration 21: Log likelihood = -31463.243  
Iteration 22: Log likelihood = -31463.243  

Generalized structural equation model               Number of obs   =   10,073

Response: yobs                                      Number of obs   =    8,378
Family:   Gaussian            
Link:     Identity            

Response: t                                         Number of obs   =   10,073
Family:   Weibull                                   No. of failures =    1,695
Form:     Proportional hazards                      Time at risk    = 8,905.45
Link:     Log                 

Log likelihood = -31463.243

 ( 1)  [yobs]_cons = 0
 ( 2)  [yobs]M1[id] = 1
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
yobs         |
           j |
          1  |   29.80313   .2129901   139.93   0.000     29.38568    30.22058
          2  |   29.87148   .2342609   127.51   0.000     29.41233    30.33062
          3  |   29.90909   .2679002   111.64   0.000     29.38401    30.43416
          4  |   29.65014   .3246781    91.32   0.000     29.01378     30.2865
          5  |   29.58625   .4108032    72.02   0.000     28.78109    30.39141
             |
        cumx |
          1  |   .0294479   .2471324     0.12   0.905    -.4549228    .5138185
          2  |   10.26199   .3182058    32.25   0.000     9.638321    10.88566
          3  |   19.95523   .4122103    48.41   0.000     19.14731    20.76314
          4  |   30.44328   .5616684    54.20   0.000     29.34243    31.54413
             |
      M1[id] |          1  (constrained)
             |
       _cons |          0  (omitted)
-------------+----------------------------------------------------------------
t            |
         1.x |  -1.080473   .1056839   -10.22   0.000    -1.287609   -.8733361
             |
      M1[id] |   .4351563   .0231816    18.77   0.000     .3897212    .4805914
             |
       _cons |  -1.669422   .1236997   -13.50   0.000    -1.911869   -1.426975
-------------+----------------------------------------------------------------
/t           |
        ln_p |   .0690261   .0513568                     -.0316313    .1696836
-------------+----------------------------------------------------------------
  var(M1[id])|   52.95996   2.558569                      48.17535    58.21975
-------------+----------------------------------------------------------------
  var(e.yobs)|    39.9193   .6916312                      38.58648    41.29815
------------------------------------------------------------------------------

. estimates store mod_gi_jm

. 
. // Compare the estimates
. estimates table mod_gi_lmm mod_gi_jm

----------------------------------------
    Variable | mod_gi_lmm   mod_gi_jm   
-------------+--------------------------
yobs         |
           j |
          1  |   25.77869     29.80313  
          2  |  25.327821    29.871478  
          3  |  25.084686    29.909089  
          4  |  24.629707     29.65014  
          5  |  24.347998    29.586254  
             |
        cumx |
          1  |  .24024772    .02944785  
          2  |  10.613805    10.261993  
          3  |  20.464419    19.955225  
          4  |   31.08476    30.443283  
             |
      M1[id] |          1            1  
             |
       _cons |          0            0  
-------------+--------------------------
  var(M1[id])|  24.613154    52.959955  
  var(e.yobs)|  40.286634    39.919297  
-------------+--------------------------
t            |
             |
           x |
          1  |              -1.0804727  
             |
      M1[id] |                .4351563  
             |
       _cons |               -1.669422  
             |
           x |
          1  |              -1.0804727  
             |
      M1[id] |                .4351563  
             |
       _cons |               -1.669422  
----------------------------------------

. 
. // Close log
. log close
      name:  <unnamed>
       log:  /Users/ellessenne/Documents/swjm/02-example-swjm-individual/02b-da
> ta-analysis-log.txt
  log type:  text
 closed on:   2 Oct 2024, 10:12:55
-------------------------------------------------------------------------------
